Revit 2027 API
BuiltInFailures.SweptBlendFailures Class
 Failures about SweptBlend.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SweptBlendFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SweptBlendFailures
Public NotInheritable Class SweptBlendFailures
public ref class SweptBlendFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SweptBlendFailures = class end
The BuiltInFailures.SweptBlendFailures type exposes the following members.
Properties
Name | Description
CannotDrawSweptblend |  Can't create swept blend.
Top
See Also
Reference
Autodesk.Revit.DB Namespace